ode-bpel-soap/bpelContent/Directions.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Directions/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.wscomposition.org/Directions/" name="Directions">
    <types />
    <message name="DirectionsRequest">
        <part name="origin" type="xsd:string" />
        <part name="destination" type="xsd:string" />
        <part name="mode" type="xsd:string" />
    </message>
    <message name="DirectionsRequestResponse">
        <part name="DirectionsResponse" type="xsd:string" />
    </message>
    <portType name="Directions">
        <operation name="DirectionsRequest" parameterOrder="origin destination mode">
            <input wsam:Action="http://www.wscomposition.org/Directions/Directions/DirectionsRequestRequest" message="tns:DirectionsRequest" />
            <output wsam:Action="http://www.wscomposition.org/Directions/Directions/DirectionsRequestResponse" message="tns:DirectionsRequestResponse" />
        </operation>
    </portType>
    <binding name="DirectionsSOAPBinding" type="tns:Directions">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
        <operation name="DirectionsRequest">
            <soap:operation soapAction="" />
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Directions/" />
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Directions/" />
            </output>
        </operation>
    </binding>
    <service name="Directions">
        <port name="DirectionsSOAP" binding="tns:DirectionsSOAPBinding">
            <soap:address location="http://localhost:9000/soapwrapper/Directions" />
        </port>
    </service>
</definitions>